---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteAllPartsWarning
source: html/2ef4bf01-77c5-edd4-175e-e11ae706022c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingDPartWillDeleteAllPartsWarning Property

Deleting a Part will delete all associated Parts and the original Element will be made visible.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingDPartWillDeleteAllPartsWarning { get; }
```